LaminarPlates/constant/polyMesh/boundary
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  5.x                                   |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       polyBoundaryMesh;
    location    "constant/polyMesh";
    object      boundary;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

5
(
    inlet
    {
        type            patch;
        nFaces          10;
        startFace       1930;
    }
    outlet
    {
        type            patch;
        nFaces          10;
        startFace       1950;
    }
    upperWall
    {
        type            wall;
        inGroups        1(wall);
        nFaces          100;
        startFace       1970;
    }
    lowerWall
    {
        type            wall;
        inGroups        1(wall);
        nFaces          100;
        startFace       2020;
    }
    frontAndBack
    {
        type            empty;
        inGroups        1(empty);
        nFaces          2000;
        startFace       2070;
    }
)

// ************************************************************************* //
